package main

func main() {
	a1 := [...]int{1, 2, 3}	//数组 array
	s1 := []int{11, 12, 13}	//slice

	var a2 [3]int = a1
	var s2 []int = s1

	println(a2[1], s2[1])
	println("--------------------------------")
	a3 := [...]int{31, 32, 33, 34, 35, 36}
	s3 := a3[:3]	//s3指向a3
	println(a3[0], s3[0])

	a3[0] = 41
	println(a3[0], s3[0])
	println("--------------------------------")

	s4 := append(s3, 1)	//s4指向a3
	println(s4[0], s4[3])
	printArray(a3)	//a3的值因为append(s3, 1)被修改了
	println("--------------------------------")

	a3[0] = 51
	println(len(s3), len(s4), len(a3))

	s5 := append(s3, s4...)	//因为s3长度不够, s5指向一个新的数组，不再指向a3
	printArray(a3)		//a3的值 没有 因为append(s3, s4...)被修改了

	println("--------------------------------")
	a3[0] = 61
	println(a3[0], s3[0], s4[0], s5[0], "\ns5 len:", len(s5))
}

func printArray(arr [6]int) {
	for _, i := range arr {
		print(i, "-")
	}
	println()

}

/*ret:
2 12
--------------------------------
31 31
41 41
--------------------------------
41 1
41-32-33-1-35-36-
--------------------------------
3 4 6
51-32-33-1-35-36-
--------------------------------
61 61 61 51 
s5 len: 7
*/